test multi endpoint at the same time.txt
┌──(sysadmin㉿kali)-[~/Downloads/transigo_performance/authentifications/signup]
└─$ k6 run --env baseURL=https://api.transigodz.com smoke.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 15 looping VUs for 2m0s (gracefulStop: 30s)
   TOTAL RESULTS 

    checks_total.......: 1468   12.047778/s
    checks_succeeded...: 49.86% 732 out of 1468
    checks_failed......: 50.13% 736 out of 1468

    ✗ validate status code
      ↳  99% — ✓ 732 / ✗ 2
    ✗ validate response body
      ↳  0% — ✓ 0 / ✗ 734

    HTTP
    http_req_duration..............: avg=2.47s min=202.15ms med=2.47s max=10.68s p(90)=3.65s p(95)=4.52s
      { expected_response:true }...: avg=2.47s min=202.15ms med=2.47s max=10.68s p(90)=3.65s p(95)=4.52s
    http_req_failed................: 0.00%  0 out of 734
    http_reqs......................: 734    6.023889/s

    EXECUTION
    iteration_duration.............: avg=2.47s min=357.48ms med=2.47s max=10.69s p(90)=3.66s p(95)=4.52s
    iterations.....................: 734    6.023889/s
    vus............................: 13     min=13       max=15
    vus_max........................: 15     min=15       max=15

    NETWORK
    data_received..................: 311 kB 2.6 kB/s
    data_sent......................: 179 kB 1.5 kB/s



running (2m01.8s), 00/15 VUs, 734 complete and 0 interrupted iterations
default ✓ [=======] 15 VUs  2m0s



┌──(sysadmin㉿kali)-[~/Downloads/transigo_performance/bookings/get_shared_booking]
└─$ k6 run --env baseURL=https://model.transigodz.com smoke.js     

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 15 looping VUs for 3m0s (gracefulStop: 30s)

WARN[0000] Error from API server                         error="listen tcp 127.0.0.1:6565: bind: address already in use"


  █ TOTAL RESULTS 

    checks_total.......: 3430    18.954202/s
    checks_succeeded...: 100.00% 3430 out of 3430
    checks_failed......: 0.00%   0 out of 3430

    ✓ status is 200
    ✓ response status is success

    HTTP
    http_req_duration..............: avg=1.57s min=97.18ms  med=1.26s max=10.22s p(90)=2.69s p(95)=3.07s
      { expected_response:true }...: avg=1.57s min=97.18ms  med=1.26s max=10.22s p(90)=2.69s p(95)=3.07s
    http_req_failed................: 0.00%  0 out of 1715
    http_reqs......................: 1715   9.477101/s

    EXECUTION
    iteration_duration.............: avg=1.57s min=211.21ms med=1.26s max=10.22s p(90)=2.69s p(95)=3.07s
    iterations.....................: 1715   9.477101/s
    vus............................: 15     min=15        max=15
    vus_max........................: 15     min=15        max=15

    NETWORK
    data_received..................: 7.9 MB 44 kB/s
    data_sent......................: 313 kB 1.7 kB/s



running (3m01.0s), 00/15 VUs, 1715 complete and 0 interrupted iterations
default ✓ [========] 15 VUs  3m0s
                                  

┌──(sysadmin㉿kali)-[~/Downloads/transigo_performance/ors]
└─$ k6 run --env baseURL=https://ors.transigodz.com smoke.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 15 looping VUs for 3m0s (gracefulStop: 30s)

WARN[0000] Error from API server                         error="listen tcp 127.0.0.1:6565: bind: address already in use"


  █ TOTAL RESULTS 

    checks_total.......: 2932    16.196429/s
    checks_succeeded...: 100.00% 2932 out of 2932
    checks_failed......: 0.00%   0 out of 2932

    ✓ validate status code
    ✓ validate response body

    HTTP
    http_req_duration..............: avg=1.84s min=322.79ms med=1.48s max=19.99s p(90)=3.25s p(95)=4.56s
      { expected_response:true }...: avg=1.84s min=322.79ms med=1.48s max=19.99s p(90)=3.25s p(95)=4.56s
    http_req_failed................: 0.00%  0 out of 1466
    http_reqs......................: 1466   8.098214/s

    EXECUTION
    iteration_duration.............: avg=1.84s min=328.93ms med=1.49s max=20s    p(90)=3.29s p(95)=4.56s
    iterations.....................: 1466   8.098214/s
    vus............................: 2      min=2         max=15
    vus_max........................: 15     min=15        max=15

    NETWORK
    data_received..................: 318 MB 1.8 MB/s
    data_sent......................: 1.3 MB 7.3 kB/s



running (3m01.0s), 00/15 VUs, 1466 complete and 0 interrupted iterations
default ✓ [=======] 15 VUs  3m0s
                                

                                                                 
┌──(sysadmin㉿kali)-[~/Downloads/transigo_performance/bookings/create_booking]
└─$ k6 run --env baseURL=https://api.transigodz.com smoke.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 15 looping VUs for 3m0s (gracefulStop: 30s)

WARN[0000] Error from API server                         error="listen tcp 127.0.0.1:6565: bind: address already in use"


  █ TOTAL RESULTS 

    checks_total.......: 290     1.588376/s
    checks_succeeded...: 100.00% 290 out of 290
    checks_failed......: 0.00%   0 out of 290

    ✓ status is 201
    ✓ response status is success

    HTTP
    http_req_duration..............: avg=18.58s min=4.21s med=16.91s max=55.95s p(90)=28.41s p(95)=32.21s
      { expected_response:true }...: avg=18.58s min=4.21s med=16.91s max=55.95s p(90)=28.41s p(95)=32.21s
    http_req_failed................: 0.00%  0 out of 145
    http_reqs......................: 145    0.794188/s

    EXECUTION
    iteration_duration.............: avg=18.77s min=4.21s med=16.91s max=55.95s p(90)=28.55s p(95)=32.22s

running (3m02.6s), 00/15 VUs, 145 complete and 0 interrupted iterations
default ✓ [=======] 15 VUs  3m0s



                                 
┌──(sysadmin㉿kali)-[~/Downloads/transigo_performance/photon]
└─$ k6 run --env baseURL=https://photon.transigodz.com smoke.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 15 looping VUs for 2m0s (gracefulStop: 30s)

WARN[0000] Error from API server                         error="listen tcp 127.0.0.1:6565: bind: address already in use"


  █ TOTAL RESULTS 

    checks_total.......: 1786    14.782799/s
    checks_succeeded...: 100.00% 1786 out of 1786
    checks_failed......: 0.00%   0 out of 1786

    ✓ validate status code
    ✓ validate response body

    HTTP
    http_req_duration..............: avg=1.98s min=465.08ms med=1.87s max=12.33s p(90)=2.8s  p(95)=3.45s
      { expected_response:true }...: avg=1.98s min=465.08ms med=1.87s max=12.33s p(90)=2.8s  p(95)=3.45s
    http_req_failed................: 0.00%  0 out of 893
    http_reqs......................: 893    7.3914/s

    EXECUTION
    iteration_duration.............: avg=2.02s min=465.77ms med=1.92s max=12.33s p(90)=2.87s p(95)=3.46s
    iterations.....................: 893    7.3914/s
    vus............................: 15     min=15       max=15
    vus_max........................: 15     min=15       max=15

    NETWORK
    data_received..................: 2.1 MB 17 kB/s
    data_sent......................: 74 kB  613 B/s


running (2m00.8s), 00/15 VUs, 893 complete and 0 interrupted iterations
default ✓ [=======] 15 VUs  2m0s



                                  
┌──(sysadmin㉿kali)-[~/Downloads/transigo_performance/authentifications/login]
└─$ k6 run --env baseURL=https://api.transigodz.com smoke.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 15 looping VUs for 3m0s (gracefulStop: 30s)

WARN[0000] Error from API server                         error="listen tcp 127.0.0.1:6565: bind: address already in use"


  █ TOTAL RESULTS 

    checks_total.......: 2464    13.590275/s
    checks_succeeded...: 100.00% 2464 out of 2464
    checks_failed......: 0.00%   0 out of 2464

    ✓ validate status code
    ✓ validate response body

    HTTP
    http_req_duration..............: avg=2.17s min=518.54ms med=1.96s max=10.68s p(90)=3.19s p(95)=3.75s
      { expected_response:true }...: avg=2.17s min=518.54ms med=1.96s max=10.68s p(90)=3.19s p(95)=3.75s
    http_req_failed................: 0.00%  0 out of 1232
    http_reqs......................: 1232   6.795137/s

    EXECUTION
    iteration_duration.............: avg=2.2s  min=518.89ms med=1.98s max=10.68s p(90)=3.24s p(95)=3.89s
    iterations.....................: 1232   6.795137/s
    vus............................: 5      min=5         max=15
    vus_max........................: 15     min=15        max=15

    NETWORK
    data_received..................: 1.6 MB 9.1 kB/s
    data_sent......................: 224 kB 1.2 kB/s



running (3m01.3s), 00/15 VUs, 1232 complete and 0 interrupted iterations
default ✓ [========] 15 VUs  3m0s